Revit 2027 API
PipeFittingAndAccessoryConnectorData.Index Property
 Return the index of this connector
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
public:
property int Index {
	int get ();
}
member Index : int with get
Property Value
Int32
See Also
Reference
PipeFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Plumbing Namespace